package com.onlineshop.controller;

public class AdminController {

  /**
   * Администрирование записей БД:
   * - редактирование справочника стран (countries)
   * - редактирование справочника поставшиков (suppliers)
   * - редактирование справочника покупателей (customers)
   * - редактирование справочника товаров (products)
   * - редактирование справочника магазинов (shops)
   * <p>
   * Управление товарными запасами:
   * - оформление поставки товара в магазин(ы)
   * - оформление отгрузки товара покупателю согласно заказу
   */
}
